Обработки/Reports/_Портфель_ФОГФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_Портфель_ФОГФ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_Портфель_ФОГФ/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Портфель ФОГФ",
		"1.08",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ВидДоговораДоверительногоУправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления");
	Если Не ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФОГФ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отчет предназначен только для счетов ДУ с видом 'Управление активами ФОГФ'");
		Возврат;
	КонецЕсли;
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
				
	Если Не ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран ответственный");
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.КонтактноеЛицо) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран ответственный");
		Возврат;
	КонецЕсли;
	
	СтруктураДанныхГлБухгалтера = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхГлБухгалтера", СтруктураДанныхГлБухгалтера);
				
	Если Не ЗначениеЗаполнено(СтруктураДанныхГлБухгалтера) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран главный бухгалтер");
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(СтруктураДанныхГлБухгалтера.КонтактноеЛицо) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран главный бухгалтер");
		Возврат;
	КонецЕсли;
			
	// Получим дату СЧА дату отчета
	ТекДатаОкончания 	= НачалоДня(ЭтотОбъект.Период);
		
	ДатаСЧАНаКонецПериода = РегистрыСведений.НастройкиФормированияСЧА.ПолучитьБлижайшуюДатуФормированияСЧА(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ТекДатаОкончания);

	Если ДатаСЧАНаКонецПериода = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отчет не сформирован");	
		Возврат;
	КонецЕсли; 	
	
	// Фиксируем старт операции
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления");
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);

	Макет = ПолучитьМакет("Макет");
	ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
	ОбластьГруппа	= Макет.ПолучитьОбласть("Группа");
	ОбластьСтрока 	= Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал   = Макет.ПолучитьОбласть("Подвал");
		
	Запрос = Новый Запрос;	
	
	#ОБЛАСТЬ ТЕКСТ_ЗАПРОСА
	
	Запрос.Текст = 	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
	|ПОМЕСТИТЬ _СчетаДоверительногоУправления
	|ИЗ
	|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаОкончания, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	БухПартииЦенныхБумагОстатки.СтоимостьВВалютеУчетаОстаток КАК БалансоваяСтоимостьБезНКД,
	|	БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ИндексацияНоминалаОстаток КАК Переоценка,
	|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВВалютеУчетаОстаток КАК НКДУплаченныйНачисленный,
	|	ВЫБОР
	|		КОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияОстаток < 0
	|			ТОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйВВалютеУчетаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Дисконт,
	|	ВЫБОР
	|		КОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияОстаток > 0
	|			ТОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйВВалютеУчетаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Премия,
	|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаОстаток КАК Корректировка,
	|	БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеОстаток КАК СуммаРезервовПодОбесценение,
	|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК Количество
	|ПОМЕСТИТЬ _ЦенныеБумагиСПартиями_КонецПериода
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
	|			&ДатаОкончания_Граница,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидУчета = &ВидУчетаБаланс
	|				И Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия))) КАК БухПартииЦенныхБумагОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага,
	|	0,
	|	БухПартииЦенныхБумагКПолучениюОстатки.ПереоценкаНаБалансеОстаток,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	БухПартииЦенныхБумагКПолучениюОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумагКПолучению.Остатки(
	|			&ДатаОкончания_Граница,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидУчета = &ВидУчетаБаланс
	|				И Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия))) КАК БухПартииЦенныхБумагКПолучениюОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
	|	СУММА(_ЦенныеБумаги.БалансоваяСтоимостьБезНКД) КАК БалансоваяСтоимостьБезНКД,
	|	СУММА(_ЦенныеБумаги.Переоценка) КАК Переоценка,
	|	СУММА(_ЦенныеБумаги.НКДУплаченныйНачисленный) КАК НКДУплаченныйНачисленный,
	|	СУММА(_ЦенныеБумаги.Дисконт) КАК Дисконт,
	|	СУММА(_ЦенныеБумаги.Премия) КАК Премия,
	|	СУММА(_ЦенныеБумаги.Корректировка) КАК Корректировка,
	|	СУММА(_ЦенныеБумаги.СуммаРезервовПодОбесценение) КАК СуммаРезервовПодОбесценение,
	|	СУММА(_ЦенныеБумаги.Количество) КАК Количество
	|ПОМЕСТИТЬ _ЦенныеБумаги_КонецПериода
	|ИЗ
	|	_ЦенныеБумагиСПартиями_КонецПериода КАК _ЦенныеБумаги
	|
	|СГРУППИРОВАТЬ ПО
	|	_ЦенныеБумаги.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЕСТЬNULL(_ЦенныеБумаги.БалансоваяСтоимостьБезНКД, 0) + ЕСТЬNULL(_ЦенныеБумаги.Переоценка, 0) + ЕСТЬNULL(_ЦенныеБумаги.Дисконт, 0) + ЕСТЬNULL(_ЦенныеБумаги.Премия, 0) + ЕСТЬNULL(_ЦенныеБумаги.Корректировка, 0) - ЕСТЬNULL(_ЦенныеБумаги.СуммаРезервовПодОбесценение, 0)) КАК Сумма_Баланс,
	|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
	|	СУММА(_ЦенныеБумаги.НКДУплаченныйНачисленный) КАК Купон_Баланс,
	|	СУММА(_ЦенныеБумаги.Количество) КАК Количество
	|ПОМЕСТИТЬ _БалансоваяСтоимостьЦБ_КонецПериода
	|ИЗ
	|	_ЦенныеБумаги_КонецПериода КАК _ЦенныеБумаги
	|
	|СГРУППИРОВАТЬ ПО
	|	_ЦенныеБумаги.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(СтоимостьПереоценки.СуммаВВалютеУчета) КАК Сумма,
	|	СУММА(СтоимостьПереоценки.СуммаКупонаВВалютеУчета) КАК СуммаКупонаВВалютеУчета,
	|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	СУММА(СтоимостьПереоценки.Количество) КАК Количество,
	|	СтоимостьПереоценки.Цена КАК Цена,
	|	СтоимостьПереоценки.ЦенаКупона КАК ЦенаКупона
	|ПОМЕСТИТЬ _СтоимостьПереоценки_КонецПериода
	|ИЗ
	|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
	|ГДЕ
	|	СтоимостьПереоценки.Период = НАЧАЛОПЕРИОДА(&ДатаСЧАНаКонецПериода, ДЕНЬ)
	|	И СтоимостьПереоценки.Организация = &Организация
	|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьПереоценки.ЦеннаяБумага,
	|	СтоимостьПереоценки.Цена,
	|	СтоимостьПереоценки.ЦенаКупона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_СтоимостьПереоценки_КонецПериода.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_СтоимостьПереоценки_КонецПериода.Количество КАК Количество,
	|	_СтоимостьПереоценки_КонецПериода.Цена КАК ОценочнаяЦена,
	|	_СтоимостьПереоценки_КонецПериода.Сумма КАК РыночнаяСтоимость,
	|	0 КАК БалансоваяСтоимость,
	|	_СтоимостьПереоценки_КонецПериода.ЦенаКупона КАК Купон,
	|	_СтоимостьПереоценки_КонецПериода.СуммаКупонаВВалютеУчета КАК ОценочнаяСтоимостьКупона,
	|	0 КАК БалансоваяСтоимостьКупона,
	|	_СтоимостьПереоценки_КонецПериода.Сумма + _СтоимостьПереоценки_КонецПериода.СуммаКупонаВВалютеУчета КАК ИтогоОценочнаяСтоимость,
	|	_СтоимостьПереоценки_КонецПериода.Сумма + _СтоимостьПереоценки_КонецПериода.СуммаКупонаВВалютеУчета КАК РазницаМеждуОценочнойИБалансовой
	|ПОМЕСТИТЬ _ОбщаяТаблица
	|ИЗ
	|	_СтоимостьПереоценки_КонецПериода КАК _СтоимостьПереоценки_КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	_БалансоваяСтоимостьЦБ_КонецПериода.ЦеннаяБумага,
	|	0,
	|	0,
	|	0,
	|	_БалансоваяСтоимостьЦБ_КонецПериода.Сумма_Баланс,
	|	0,
	|	0,
	|	_БалансоваяСтоимостьЦБ_КонецПериода.Купон_Баланс,
	|	0,
	|	-(_БалансоваяСтоимостьЦБ_КонецПериода.Сумма_Баланс + _БалансоваяСтоимостьЦБ_КонецПериода.Купон_Баланс)
	|ИЗ
	|	_БалансоваяСтоимостьЦБ_КонецПериода КАК _БалансоваяСтоимостьЦБ_КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ОбщаяТаблица.ЦеннаяБумага КАК ЦеннаяБумага,
	|	СУММА(_ОбщаяТаблица.Количество) КАК Количество,
	|	СУММА(_ОбщаяТаблица.ОценочнаяЦена) КАК ОценочнаяЦена,
	|	СУММА(_ОбщаяТаблица.РыночнаяСтоимость) КАК РыночнаяСтоимость,
	|	СУММА(_ОбщаяТаблица.БалансоваяСтоимость) КАК БалансоваяСтоимость,
	|	СУММА(_ОбщаяТаблица.Купон) КАК Купон,
	|	СУММА(_ОбщаяТаблица.ОценочнаяСтоимостьКупона) КАК ОценочнаяСтоимостьКупона,
	|	СУММА(_ОбщаяТаблица.БалансоваяСтоимостьКупона) КАК БалансоваяСтоимостьКупона,
	|	СУММА(_ОбщаяТаблица.ИтогоОценочнаяСтоимость) КАК ИтогоОценочнаяСтоимость,
	|	СУММА(_ОбщаяТаблица.РазницаМеждуОценочнойИБалансовой) КАК РазницаМеждуОценочнойИБалансовой
	|ПОМЕСТИТЬ _СвернутаяТаблица
	|ИЗ
	|	_ОбщаяТаблица КАК _ОбщаяТаблица
	|
	|СГРУППИРОВАТЬ ПО
	|	_ОбщаяТаблица.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыОрганизации.ПолноеНаименованиеПоУставу КАК НаименованиеУК,
	|	РеквизитыКлиента.ПолноеНаименованиеПоУставу КАК НаименованиеКлиента,
	|	РеквизитыАнкетныеФОГФ.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеФОГФ,
	|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговораДУ,
	|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаДоговораДУ,
	|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
	|ИЗ
	|	_СчетаДоверительногоУправления КАК КлиентыДоверительногоУправленияСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
	|				&ДатаОкончания,
	|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
	|					И Организация = &Организация) КАК РеквизитыКлиента
	|		ПО (РеквизитыКлиента.ЮрФизЛицо = КлиентыДоверительногоУправленияСрезПоследних.Клиент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
	|				&ДатаОкончания,
	|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
	|					И Организация = &Организация) КАК РеквизитыОрганизации
	|		ПО (РеквизитыОрганизации.ЮрФизЛицо = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Организация.ЮрФизЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
	|				&ДатаОкончания,
	|				Организация = &Организация
	|					И ЮрФизЛицо = &ФОГФ
	|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыАнкетныеФОГФ
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(_СвернутаяТаблица.ЦеннаяБумага) = ТИП(Справочник.Облигации)
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(_СвернутаяТаблица.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
	|						ТОГДА 1
	|					КОГДА ВЫРАЗИТЬ(_СвернутаяТаблица.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Субфедеральная)
	|						ТОГДА 2
	|					ИНАЧЕ 4
	|				КОНЕЦ
	|		КОГДА ТИПЗНАЧЕНИЯ(_СвернутаяТаблица.ЦеннаяБумага) = ТИП(Справочник.Акции)
	|				И ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.РезидентРФ, ЛОЖЬ) = ИСТИНА
	|			ТОГДА 3
	|		ИНАЧЕ 5
	|	КОНЕЦ КАК Группа,
	|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК НаименованиеЦБ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(_СвернутаяТаблица.ЦеннаяБумага) = ТИП(Справочник.Облигации)
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(_СвернутаяТаблица.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
	|						ТОГДА ЕСТЬNULL(КодыВТорговыхСистемахКодНаММВБ.Код, """""""")
	|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахISIN.Код, """""""")
	|				КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахISIN.Код, """""""")
	|	КОНЕЦ КАК ISIN,
	|	_СвернутаяТаблица.Количество КАК Количество,
	|	_СвернутаяТаблица.ОценочнаяЦена КАК ОценочнаяЦена,
	|	_СвернутаяТаблица.РыночнаяСтоимость КАК РыночнаяСтоимость,
	|	_СвернутаяТаблица.БалансоваяСтоимость КАК БалансоваяСтоимость,
	|	_СвернутаяТаблица.Купон КАК Купон,
	|	_СвернутаяТаблица.ОценочнаяСтоимостьКупона КАК ОценочнаяСтоимостьКупона,
	|	_СвернутаяТаблица.БалансоваяСтоимостьКупона КАК БалансоваяСтоимостьКупона,
	|	_СвернутаяТаблица.ИтогоОценочнаяСтоимость КАК ИтогоОценочнаяСтоимость,
	|	_СвернутаяТаблица.РазницаМеждуОценочнойИБалансовой КАК РазницаМеждуОценочнойИБалансовой
	|ИЗ
	|	_СвернутаяТаблица КАК _СвернутаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
	|				&ДатаОкончания,
	|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
	|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
	|		ПО _СвернутаяТаблица.ЦеннаяБумага.Эмитент.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ДатаОкончания, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахISIN
	|		ПО _СвернутаяТаблица.ЦеннаяБумага = КодыВТорговыхСистемахISIN.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ДатаОкончания, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБ)) КАК КодыВТорговыхСистемахКодНаММВБ
	|		ПО _СвернутаяТаблица.ЦеннаяБумага = КодыВТорговыхСистемахКодНаММВБ.Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	Группа,
	|	НаименованиеЦБ
	|ИТОГИ
	|	СУММА(РыночнаяСтоимость),
	|	СУММА(БалансоваяСтоимость),
	|	СУММА(ОценочнаяСтоимостьКупона),
	|	СУММА(БалансоваяСтоимостьКупона),
	|	СУММА(ИтогоОценочнаяСтоимость),
	|	СУММА(РазницаМеждуОценочнойИБалансовой)
	|ПО
	|	ОБЩИЕ,
	|	Группа";
	
	#КОНЕЦОБЛАСТИ 
	
	Запрос.УстановитьПараметр("ДатаОкончания", 					КонецДня(ЭтотОбъект.Период));
	Запрос.УстановитьПараметр("Организация", 					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ДатаОкончания_Граница", 			Новый Граница(КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая)); 
	Запрос.УстановитьПараметр("ДатаСЧАНаКонецПериода", 			ДатаСЧАНаКонецПериода);
		
	Запрос.УстановитьПараметр("ВидУчетаБаланс",					Перечисления.ВидыУчета.БухгалтерскийУчет);
	Запрос.УстановитьПараметр("ФОГФ",						  	ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_ФОГФ"));
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ИндексПоследнегозапроса = ПакетЗапросов.ВГраница();
	
	// Шапка
	Выборка = ПакетЗапросов[ИндексПоследнегоЗапроса - 1].Выбрать();

	Если Выборка.Следующий() Тогда				
		ОбластьШапка.Параметры.Заполнить(Выборка);
		ОбластьШапка.Параметры.ДатаДоговораДУ = Формат(Выборка.ДатаДоговораДУ, "ДЛФ=DD");
		ОбластьШапка.Параметры.ПолноеНаименованиеФОГФРП = ПолучитьСклоненияСтроки(Выборка.ПолноеНаименованиеФОГФ, "", "ПД=Родительный")[0];
	КонецЕсли;
	
	ОбластьШапка.Параметры.ДатаОтчета 			= Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy");	
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	// Группы ценных бумаг
	ВыборкаОбщиеИтоги = ПакетЗапросов[ИндексПоследнегоЗапроса].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Общие итоги
	Если ВыборкаОбщиеИтоги.Следующий() Тогда
		ОбластьПодвал.Параметры.Заполнить(ВыборкаОбщиеИтоги);
		ВыборкаГруппа = ВыборкаОбщиеИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
		Пока ВыборкаГруппа.Следующий() Цикл
			ОбластьГруппа.Параметры.Заполнить(ВыборкаГруппа);
			
			ОбластьГруппа.Параметры.НаименованиеЦБ = ПолучитьНаименованиеГруппы(ВыборкаГруппа.Группа);
			
			ДокументРезультат.Вывести(ОбластьГруппа);
			ВыборкаСтроки = ВыборкаГруппа.Выбрать();
			Пока ВыборкаСтроки.Следующий() Цикл
				ОбластьСтрока.Параметры.Заполнить(ВыборкаСтроки);
				ДокументРезультат.Вывести(ОбластьСтрока);
			КонецЦикла;
		КонецЦикла; 	
	КонецЕсли;	
		
	// Подписи	
	
	ОбластьПодвал.Параметры.Ответственный 		= СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
	ОбластьПодвал.Параметры.ДолжностьДиректор 	= СтруктураДанныхКонтактногоЛица.Должность + " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий +  ")";

	ОбластьПодвал.Параметры.ГлавныйБухгалтер 	= СтруктураДанныхГлБухгалтера.КонтактноеЛицо;
	ОбластьПодвал.Параметры.ДолжностьГлавбух    = СтруктураДанныхГлБухгалтера.Должность;
	
	ДокументРезультат.Вывести(ОбластьПодвал);
		
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя());
	
	// Фиксируем завершение операции
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		
КонецПроцедуры

Функция ПолучитьНаименованиеГруппы(Группа)
	
	Если Группа = 1 Тогда
		Возврат "Ценные бумаги РФ";
	ИначеЕсли Группа = 2 Тогда
		Возврат "Ценные бумаги субъектов РФ";
	ИначеЕсли Группа = 3 Тогда
		Возврат "Акции российских АО";
	ИначеЕсли Группа = 4 Тогда
		Возврат "Корпоративные облигации";
	КонецЕсли;
	
	Возврат "Прочие ЦБ";
	
КонецФункции
